package arrays.reference_types;

public class Country {
    String name;
}


// Product (name, price)
// Сколько товаров хотите добавить? 4
// Введите название товара: Iphone 12
// Введите стоимость товара: 299990
// Введите название товара: Iphone 14
// Введите стоимость товара: 499990
// Введите название товара: Iphone 15
// Введите стоимость товара: 599990
// Введите название товара: Iphone 15 PRO
// Введите стоимость товара: 699990

// Товары:
// Iphone 12 299990
// Iphone 14 499990
// Iphone 15 599990
// Iphone 15 Pro 699990